Repository: devsnd/cherrymusic
Catalog: res/i18n/*/LC_MESSAGES/default.po
Languages: de

source: Not secure, redirecting...
de: Keine sichere Verbindung. Weiterleiten auf sicheren Port...

source: user {name} just logged in.
de: Benutzer {name} hat sich eingeloggt.

source: Dropping all sessions! Try not to change between python 2 and 3, everybody has to relogin now.
de: Setze alle Benutzersessions zurück! Möglichst nicht zwischen Python 2 und 3 wechseln, jeder Benutzer muss sich jetzt neu einloggen.

source: Rejected remote admin login from user: {name}
de: Admin-Login über Netzwerkverbindung abgewiesen für Benutzer: {name}

source: Fetching album art for keywords {keywords!r}
de: Coverbild herunterladen für Schlüsselwörter {keywords!r}

source: processing whole search request
de: Bearbeite vollständgige Suchanfrage

source: rendering search results as json
de: Suchergebnisse als JSON rendern

source: Please log in
de: Bitte einloggen

source: Unknown playlist format: {format!r}
de: Unbekanntes Playlist-Format: {format!r}

source: No playlists found
de: Keine Playlisten gefunden

source: resizing of album covers
de: automatische Größenanpassung von Album-Coverbildern

source: The executable "convert" was not found in you PATH
de: Ausführbare Datei "convert" nicht im PATH gefunden

source: encoding and decoding of OGGs
de: Encoding und Decoding für OGG-Formate

source: The executables "oggenc" and "oggdec" were not found in you PATH
de: Ausführbare Dateien "oggenc" und "oggdec" nicht im PATH gefunden

source: encoding and decoding of MP3s
de: Encoding und Decoding für MP3-Formate

source: The executable "lame" was not found in you PATH
de: Ausführbare Datei "lame" nicht im PATH gefunden

source: encoding and decoding of FLACs
de: Encoding und Decoding für FLAC-Formate

source: The executable "flac" was not found in you PATH
de: Ausführbare Datei "flac" nicht im PATH gefunden

source: decoding OGG, MP3, FLAC, WMA and AAC
de: Decoding von OGG, MP3, FLAC, WMA und AAC

source: The executable "mplayer" was not found in you PATH
de: Ausführbare Datei "mplayer" nicht im PATH gefunden

source: Starting setup server on port {port} ... Open your browser and put the server IP:{port} in the address bar. If you run the server locally, use: localhost:{port}.
de: Starte Setup-Server auf dem Port {port} ... Browser öffnen und SERVER_IP:{port} in die Adresszeile eingeben. Wenn der Server auf dem lokalen Rechner läuft, dann localhost:{port} benutzen.

source: cherrypy version is too old! Current version: %(current_version)s Required version: %(required_version)s or higher
de: cherrypy Version ist veraltet! Gefundene Version: %(current_version)s Vorrausgesetzte Version %(required_version)s

source: database schema update aborted. quitting.
de: Datenbankschema Aktualisierung abgebrochen. Programm beendet.

source: Default configuration file written to %(path)r
de: Neue Konfigurationsdatei angelegt: %(path)r

source: Invalid basedir. Please provide a valid basedir path.
de: Ungültiges basedir. Bitte einen gültigen Pfad zum basedir angeben.

source: ============================================ Process id file %s already exists. If you are sure that cherrymusic is not running, you can delete this file and restart cherrymusic. ============================================
de: ============================================ Prozess id Datei %s existiert bereits. Falls sicher ist, dass cherrymusic nicht bereits gestartet ist, kann die Datei gelöscht und cherrymusic neu gestartet werden. ============================================

source: Error removing pid file, doesn't exist!
de: Fehler beim löschen der PID Datei, sie existierte nicht!

source: Starting server on port %s ...
de: Starte Server auf Port %s ...

source: ========================================================================== A database schema update is needed and requires your consent. {reasons} To continue without changes, you need to downgrade to an earlier version of CherryMusic. To backup your database files first, abort for now and find them here: {dblocation} ========================================================================== Run schema update? [y/N]:
de: ========================================================================== Eine Datenbankstruktur-Aktualisierung ist nötig, welche eine Zustimmung verlangt. {reasons} Um ohne Änderungen fortzufahren, müsste CherryMusic zu einer älteren Version down-ge-gradet werden. Um vorher ein Datenbank-Backup zu machen muss das Update abgebrochen werden. Die Datenbank-Dateien befinden sich hier: {dblocation} ========================================================================== Datenbank-Aktualisierung jetzt durchführen? [y/N]:

source: New configuration options available: %s Using default values for now.
de: Neue Konfigurationsoptionen verfügbar: %s Verwende vorerst die Standardwerte.

source: The following configuration options are not used anymore: %s
de: Folgende Konfigurationsoptionen werden nicht mehr verwendet: %s

source: Start with --newconfig to generate a new default config file next to your current one.
de: Starte mit --newconfig um eine neue Konfigurationsdatei neben der bereits vorhandenen zu erstellen.

source: BASEDIR specifies where the media that should be served is located. It must be an absolute path, e.g. BASEDIR=/absolute/path/to/media. Links: If your operating system supports them, you can use symlinks directly in BASEDIR. Links to directories which contain BASEDIR will be ignored, just like all links not directly in, but in sublevels of BASEDIR. This is to guard against the adverse effects of link cycles.
de: BASEDIR gibt das Basisverzeichnis an, in dem sich die Mediendateien befinden. Ein absoluter Pfad wird benötigt, z.B. BASEDIR=/absoluter/pfad/zu/medien. Links: Falls vom Betriebssystem unterstützt, können symbolische Links direkt im BASEDIR platziert werden. Links zu übergeordneten Verzeichnissen zu BASEDIR werden ignoriert; ebenso alle Links, die sich nicht direkt im BASEDIR, sondern in Unterverzeichnissen befinden. Das ist notwendig, um den schaurigen Konsequenzen zirkulärer Verlinkungen vorzubeugen.

source: TRANSCODE (experimental!) enables automatic live transcoding of the media to be able to listen to every format on every device. This requires you to have the appropriate codecs installed. Please note that transcoding will significantly increase the stress on the CPU!
de: TRANSCODE (experimentelles Feature!) ermöglicht es, auf Serverseite live in unterstützte Formate zu transcodieren. Dadurch lassen sich alle möglichen Formate auf verschiedenen Geräten und mit verschiedenen Browsern abspielen, die sonst auf dieser (Client-)Seite nicht unterstützt werden. Dazu müssen auf dem Server die entsprechenden Codecs (Binaries) installiert sein. Achtung, Transcoding stellt deutlich höhere Anforderungen an die Rechenleistung!

source: Tries to fetch the album cover from various locations in the web, if no image is found locally. By default it will be fetched from amazon. They will be shown next to folders that qualify as a possible album.
de: Coverbilder automatisch von verschiedenen Webseiten laden, wenn lokal kein Bild gefunden werden kann. Standardmäßig muss der Amazon-Katalog herhalten. Diese Bilder werden im Client neben Ordnern angezeigt, die vom Server als Album eingestuft werden.

source: Show the number of sub-folders and tracks contained in any folder. This will increase the stress for the server, so if you're running CherryMusic on a 386DX II or similar, it is recommended to deactivate this feature.
de: Im Browser die Anzahl der in einem Ordner enthaltenen Unterordner und Titel anzeigen. Diese Option erhöht die Belastung des Servers. Sollte CherryMusic auf deinem alten 386er oder einem sonswie leistungsschwachen System laufen, wird empfohlen, dieses Feature zu deaktivieren.

source: Maximum size in bytes of all files to be downloaded in one zipfile. Defaults to {default_value} {default_unit}.
de: Maximalgröße (in Bytes) für den Download von Dateien in einer zip-Datei. Standardwert ist {default_value} {default_unit}.

source: MAXRESULTS sets the maximum amount of search results to be displayed. If MAXRESULTS is set to a higher value, the search will take longer, but will also be more accurate.
de: MAXRESULTS gibt an, wieviele Suchergebnisse höchstens angezeigt werden. Ein höherer Wert verlangsamt die Suche, führt aber zu genaueren Ergebnissen.

source: This will load parts of the database into memory for improved performance. This option should only be used on systems with sufficient memory, because it will hurt the performance otherwise.
de: Teile der Datenbank werden in den Hauptspeicher geladen, um die Geschwindigkeit der Anfragen zu steigern. Nur auf Systemen anschalten, die über genug freien Speicher verfügen -- sonst passiert das Gegenteil und alles wird wirklich langsam.

source: MAXSHOWFILES specifies how many files and folders should be shown at the same time. E.g. if you open a folder with more than MAXSHOWFILES, the files will be grouped according to the first letter in their name. 100 is a good value, as a CD can have up to 99 tracks.
de: MAXSHOWFILES legt fest, wieviele Ordner und Dateien höchstens angezeigt werden. Längere Listen werden nach Anfangsbuchstaben gruppiert. 100 ist ein guter Wert, weil eine CD bis zu 99 Titel enthalten kann.

source: Only use the media database, never the filesystem, for content lookups in browser and search. Useful if the media files reside on an external hard drive or behind a slow network connection.
de: Lässt den Server für Dateisuche und den Dateibrowser nur die Mediendatenbank benutzen, statt möglicherweise im Dateisystem nachzusehen. Nützlich, falls das BASEDIR sich auf einer externen Festplatte oder am anderen Ende einer langsamen Netzwerkverbindung befindet.

source: The port the server will listen to.
de: Der Port, auf den der Server reagieren soll.

source: When set to true, the server will listen on a IPv6 socket instead of IPv4
de: "True" setzen, damit der Server einen IPv6 Socket benutzt statt (wie sonst) IPv4.

source: When localhost_only is set to true, the server will not be visible in the network and only play music on the same computer it is running on. Activating this option binds the server to IP 127.0.0.1 or [::1], depending on whether server.ipv6_enabled is true. The server should also be reachable as "localhost" in any case.
de: Auf "True" setzen, damit der Server nicht auf Anfragen aus dem Netzwerk reagiert und Musik nur auf dem gleichen Rechner abspielt, auf dem er läuft. Diese Option bindet den Server an die IP 127.0.0.1 bzw. [::1], je nach Einstellung von server.ip6_enabled. Der Server sollte in jedem Fall auch als "localhost" erreichbar sein.

source: The path cherrymusic will be available on. Normally you'll want to leave it as '/', so that CherryMusic is available under e.g. localhost:8080. You might want to change the path if CherryMusic runs behind a reverse proxy. Changing it to '/cherrymusic' will make it available under e.g. localhost:8080/cherrymusic
de: Der URL-Pfad-Präfix, unter dem CherryMusic erreichbar ist. Normalerweise ist CherryMusic als Root-Ressource '/' eingebunden, und antwortet z.B. als localhost:8080. Wenn CherryMusic als Unterressource hinter einem Reverse Proxy o.ä. erreichbar ist, muss dieser Wert angepasst werden. Der Wert '/cherrymusic' würde z.B. gelten, wenn CherryMusic als localhost:8080/cherrymusic erreichbar ist.

source: When localhost_auto_login is set to "True", the server will not ask for credentials when using it locally. The user will be automatically logged in as admin.
de: Wenn localhost_auto_login auf "True" gesetzt ist, fragt der Server nicht nach Authentifizierung wenn er lokal angesprochen wird (als localhost o.ä.). Stattdessen wird automatisch der Admin-Benutzer eingeloggt, der beim Setup erzeugt wurde.

source: When permit_remote_admin_login is set to "False", admin users may only log in from the computer cherrymusic is currently running on. This can improve security.
de: Wenn permit_remote_admin_login auf "False" gesetzt ist, können sich Admin-Benutzer nur vom selben Rechner aus anmelden, auf dem CherryMusic läuft. Das kann die Sicherheit des Systems erhöhen.

source: Will keep the user sessions in RAM instead of a file in the configuration directory. This means, that any unsaved playlists will be lost when the server is restarted.
de: Benutzersessions werden im Arbeitsspeicher des Servers gehalten und nicht als Dateien angelegt. Ungespeicherte Playlisten der Benutzer gehen dann verloren, wenn der Server beendet oder neugestartet wird.

source: The following options allow you to use cherrymusic with https encryption. If ssl_enabled is set to "False", all other ssl options will be ommited.
de: Die folgenden Einstellungen erlauben es, CherryMusic mit https-Verschlüsselung zu benutzen. Wenn ssl_enabled auf "False" gesetzt ist, werden alle weiteren ssl-Optionen ignoriert.

source: The port that will listen to SSL encrypted requests. If ssl_enabled is set to "True", all unencrypted HTTP requests will be redirected to this port.
de: Der Port für SSL/TLS-verschlüsselte Kommunikation. Wenn ssl_enabled auf "True" gesetzt ist, werden alle unverschlüsselten Anfragen auf diesen Port weitergeleitet.

source: The SSL certiticate sent to the client to verify the server's authenticity. A relative path is relative to the location of the CherryMusic configuration file.
de: Der Pfad zum SSL-Zertifikat, mit dem sich der Server bei Clients authentifiziert. Ein relativer Pfad wird interpretiert als relativ zum Verzeichnis der CherryMusic-Kofigurationsdatei cherrymusic.conf.

source: SSL private key file used by the server to decrypt and sign secure communications. Keep this one secret! A relative path is relative to the location of the CherryMusic configuration file.
de: Der Pfad zum privaten SSL-Schlüssel, mit dem der Server Nachrichten in gesicherten Verbindungen entschlüsselt und signiert. Der Schlüssel muss auf jeden Fall geheim bleiben! Ein relativer Pfad wird interpretiert als relativ zum Verzeichnis der CherryMusic-Konfigurationsdatei.

source: Notify admins about available security and feature updates.
de: Admin-Benutzer im Webclient über neue Features und Sicherheitsupdates benachrichtigen.

source: configuration file not found: %(filepath)s
de: Konfigurationsdatei nicht gefunden: %(filepath)s

source: configuration path is not a file: %(filepath)s
de: Konfigurationspfad ist keine Datei: %(filepath)s

source: This playlist doesn't exist! Nothing deleted!
de: Playlist existiert nicht, nichts geloescht!

source: This playlist belongs to another user! Nothing deleted.
de: Playlist gehoert einem anderen Benutzer, nichts geloescht!

source: I will not create an empty playlist. sorry.
de: Ich kann keine leere Playlist erstellen, sorry.

source: This playlist name already exists! Nothing saved.
de: Dieser Playlistname existiert bereits! Nichts gespeichert.

source: terms must not contain ''
de: begriffe duerfen '' nicht enthalten

source: searching for a maximum of %s files
de: suche nach maximal %s dateien

source: file id fetching
de: holen der file ids

source: sorting results by fileid occurrences
de: sortiere Ergebnisse nach Anzahl der Vorkommnisse

source: querying fullpaths for %s fileIds
de: Abfragen des vollen Pfades fuer %s fileIds

source: querying fullpaths for %s fileIds, files only
de: Abfragen des vollen Pfades fuer %s fileIds, nur Dateien

source: media cache cannot listdir %r: path not in database
de: media cache kann Verzeichnis %r nicht listen: Pfad nicht in Datenbank gefunden

source: wrong encoding for filename '%s' (%s)
de: Falsche Dateinamen-Enkodierung fuer '%s' (%s)

source: removing dead reference(s): %s "%s"
de: Entferne obsolete Referenzen: %s "%s"

source: error while removing dead reference(s): %s
de: Fehler beim entfernen obsoleter Referenzen: %s

source: rolled back to safe state.
de: Zu sicherem Status zurueckgekehrt.

source: error removing entry for %s
de: Fehler beim entfernen des Eintrages %s

source: media base directory: %r
de: Medien Ober-Ordner: %r

source: running full update...
de: Starte volles Update...

source: error during media update. database update incomplete.
de: Fehler beim Medien-Update. Datenbank-Update nicht abgeschlossen.

source: media database update complete.
de: Medien-Datenbank Update abgeschlossen.

source: updating paths: %s
de: Aktualisiere Pfade: %s

source: path is not in basedir. skipping %r
de: Pfad ist nicht im "basedir". ueberspringe: %r

source: updating %r...
de: aktualisiere %r...

source: update incomplete: %r
de: Aktualisierung unvollstaendig: %r

source: done updating paths.
de: Pfadaktualisierung abgeschlossen.

source: recursive update for %s
de: Rekursive Aktualisierung von %s

source: error while updating media: %s %s
de: Fehler beim Aktualisieren der Medien: %s %s

source: rollback to previous commit.
de: Wiederherstellung der zuvorigen Zustands.

source: items added %d, removed %d
de: Eintraege hinzugefuegt %d, geloescht %d

source: updating word occurrences...
de: Aktualisiere Wortvorkommnisse...

source: argument must be an abolute path: "%s"
de: Argument muss ein absoluter Pfad sein! "%s"

source: argument must be a path in basedir (%s): "%s"
de: Argument muss ein Pfad im "basedir" (%s) sein! "%s"

source: parent path not in database: %r
de: Ueberliegender Pfad nicht in Datenbank: %r

source: creating database entry for %r
de: Erstelle Datenbankeintrag fuer %r

source: unable to decode filename %r in %r; skipping.
de: Kann den Dateinamen %r nicht in in %r dekodieren; ueberspringe.

source: expecting unicode path, got %s
de: Erwartete unicode Pfad, erhielt %s

source: cannot list directory: %s
de: Kann Veryeichnis nicht listen: %s

source: file not found: %s. skipping.
de: Datei nicht gefunden: %s. ueberspringe.

source: file not in basedir: %s. skipping.
de: Datei ist nicht im "basedir": %s. ueberspringe.

source: Loading files database into memory...
de: Lade Datenbank in den Arbeitsspeicher...

source: ========================================================================== Oops! CherryMusic changed some file locations while you weren't looking. (To better comply with best practices, if you wanna know.) To continue, please move the following: $ mv {src} {tgt}
de: ========================================================================== Hoppla! CherryMusic hat ein paar Dateipfade geändert! (Um den Standards besser zu entsprechen, man fragt sich, warum...) Um fortzufahren müssen folgende Dateien verschoben werden: $ mv {src} {tgt}

source: Exception while updating database schema.
de: Fehler beim Aktualisieren des Datenbankschemas.

source: Database error. This is probably due to your version of sqlite being too old. Try updating sqlite3 and updating python. If the problem persists, you will need to delete the database at
de: Datenbankfehler. Wahrscheinlich ist die Version von SQLite zu alt. sqlite3 und python aktualisieren. Wenn das nicht hilft, muss die folgende Datenbankdatei gelöscht werden:

source: %d years ago
de: vor %d Jahren

source: a year ago
de: vor einem Jahr

source: %d months ago
de: vor %d Monaten

source: a month ago
de: vor einem Monat

source: %d weeks ago
de: vor %d Wochen

source: a week ago
de: vor einer Woche

source: %d days ago
de: vor %d Tagen

source: a day ago
de: Gestern

source: %d hours ago
de: vor %d Stunden

source: an hour ago
de: vor einer Stunde

source: half an hour ago
de: vor einer halben Stunde

source: %d minutes ago
de: vor %d Minuten

source: a minute ago
de: vor einer Minute

source: a few seconds ago
de: vor ein paar Sekunden

source: in %d years
de: in %d Jahren

source: in a year
de: in einem Jahr

source: in %d months
de: in %d Monaten

source: in a month
de: in einem Monat

source: in %d weeks
de: in %d Wochen

source: in a week
de: in einer Woche

source: in %d days
de: in %d Tagen

source: in a day
de: Morgen

source: in %d hours
de: in %d Stunden

source: in an hour
de: in einer Stunde

source: in half an hour
de: in einer halben Stunde

source: in %d minutes
de: in %d Minuten

source: in a minute
de: in einer Minute

source: in a few seconds
de: in ein paar Sekunden

source: just now
de: jetzt gerade

source: Error writing file %(name)r to memory zip
de: Fehler beim Schreiben der Datei %(name)r nach memory zip

source: empty username or password!
de: Benutzername oder Passwort leer!

source: not a valid password
de: kein gueltiges Passwort

source: name must not be empty
de: Name darf nicht leer sein

source: password must not be empty
de: Passwort darf nicht leer sein

source: Error listing directory %s: %s
de: Kann Verzeichnis %s nicht listen: %s

source: %(user)s searched for '%(term)s'
de: %(user)s hat gesucht nach '%(term)s'

source: sorting DB results using ResultOrder
de: sortiere DB-Ergebnisse mit ResultOrder

source: checking and classifying results:
de: prüfe und klassifiziere Ergebnisse:

source: Error fetching version info: %s
de: Fehler beim Lesen der Versionsinfo: %s

source: track has no path set!
de: Track hat keinen Dateipfad!

source: track has no label set!
de: Track hat kein Titel!
